ip_a = '61.58.73.42'
ip_b = '61.58.75.136'
mask = '255.255.252.0'
addr = '61.58.72.0'
# print(f'{61:b}'.rjust(8, '0'))
# print(f'{58:b}'.rjust(8, '0'))
# print(f'{72:b}'.rjust(8, '0'))

# 00111101.00111010.01001000.00000000 - адрес сети - 11 единиц
# 11111111.11111111.111111__.________
# 11111111.11111111.1111111.11111111

t = [n for n in range(1,1023) if f'{n:b}'.count('1')%2 == 0]
print(len(t))


"""
print(f'{73:b}'.rjust(8, '0'))
print(f'{75:b}'.rjust(8, '0'))
# 1022 - всего узлов в нашей сети

print(73 & 252)
print(75 & 252)

print(int('11111100', 2))

addr = ip_a & mask

node = 6  # 00000110
mask = 5  # 00000101
addr = 4   # 00000100
print(node & mask)  # 4

00000000.00000000.00000000.00000000
все нули - адрес сети
все единицы - адрес широковещ - 


mask = 18 единиц
11111111.11111111.11000000.00000000
255.255.192.0

под адрес узла нельзя использовать
________.________.__000000.00000000
________.________.__111111.11111111
"""